# Explanation

# First of all
this is Data telling story of Teacher Kholed Langsari.
- He is a Teacher of Computer knowledge from Fatoni University.
- This is the data that told about history of Teacher Kholed that have teached.

## Import

import all of this module to work with data.

In [74]:
import seaborn as sns
import pandas as pd
from pandas import Series,DataFrame
import numpy as np
import matplotlib.pyplot as plt

## Upload

Upload The data form teacher kholed.

In [75]:
# This is first upload data and it's not ready.
d=pd.read_excel('C:/Users/TUF GAMING/Documents/GitHub/data-science-with-python-2022/DataFrame of T.kholed/kholed-subject-teach.xlsx')

# Checking

Checking step is check the data
- How many data.
- How is it.
- How do we manange with it.

In [76]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   0 non-null      float64
 1   Unnamed: 1   0 non-null      float64
 2   Unnamed: 2   0 non-null      float64
 3   Unnamed: 3   0 non-null      float64
 4   Unnamed: 4   0 non-null      float64
 5   Unnamed: 5   26 non-null     object
 6   Unnamed: 6   24 non-null     object
 7   Unnamed: 7   22 non-null     object
 8   Unnamed: 8   22 non-null     object
 9   Unnamed: 9   22 non-null     object
 10  Unnamed: 10  1 non-null      object
dtypes: float64(5), object(6)
memory usage: 2.5+ KB

In [77]:
d.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,รหัสวิชา,รายวิชา,กลุ่ม,จำนวนรับ,ลงแล้ว,ส่งออก
3,NaN,NaN,NaN,NaN,NaN,ภาคการศึกษาที่ 1,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,มหาวิทยาลัยฟาฏอนี,ปริญญาตรี,NaN,NaN,NaN,NaN

In [78]:
d.tail()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
23,NaN,NaN,NaN,NaN,NaN,IT2301-214,พื้นฐานปัญญาประดิษฐ์,2,10,0,NaN
24,NaN,NaN,NaN,NaN,NaN,IT2301-229,DevOps,1,8,0,NaN
25,NaN,NaN,NaN,NaN,NaN,IT2301-229,DevOps,2,5,0,NaN
26,NaN,NaN,NaN,NaN,NaN,IT2301-318,ปัญญาประดิษฐ์ขั้นพื้นฐาน,1,18,0,NaN
27,NaN,NaN,NaN,NaN,NaN,IT2301-318,ปัญญาประดิษฐ์ขั้นพื้นฐาน,2,5,0,NaN

In [79]:
d.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10'],
      dtype='object')

In [80]:
d.describe()

       Unnamed: 0  Unnamed: 1  Unnamed: 2  Unnamed: 3  Unnamed: 4
count         0.0         0.0         0.0         0.0         0.0
mean          NaN         NaN         NaN         NaN         NaN
std           NaN         NaN         NaN         NaN         NaN
min           NaN         NaN         NaN         NaN         NaN
25%           NaN         NaN         NaN         NaN         NaN
50%           NaN         NaN         NaN         NaN         NaN
75%           NaN         NaN         NaN         NaN         NaN
max           NaN         NaN         NaN         NaN         NaN

This is not worth it, And we had to clean the data and create new one.

- Now we got new data, That i was create dataset to be table.

# Upload New data.
data name " newdata.xlsx "

In [81]:
df=pd.read_excel('C:/Users/TUF GAMING/Documents/GitHub/data-science-with-python-2022/DataFrame of T.kholed/newdata.xlsx')

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 131 entries, 0 to 130
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         131 non-null    int64
 1   Term         131 non-null    int64
 2   Subject No.  131 non-null    object
 3   Group        131 non-null    int64
 4   Limit        131 non-null    int64
 5   Registered   131 non-null    int64
 6   Course       131 non-null    int64
 7   Hours        131 non-null    int64
 8   People       131 non-null    int64
 9   Year Group   131 non-null    int64
 10  Term Group   131 non-null    int64
 11  All student  131 non-null    int64
dtypes: int64(11), object(1)
memory usage: 12.4+ KB

In [83]:
df.head()

,Year,Term,Subject No.,Group,Limit,Registered,Course,Hours,People,Year Group,Term Group,All student
0,2554,1,GE219-501,1,55,42,108,1728,1372,6,4,144
1,2554,1,GE219-501,2,47,21,108,1728,1372,6,4,144
2,2554,1,GE219-501,4,45,32,108,1728,1372,6,4,144
3,2554,1,GE219-501,3,45,1,108,1728,1372,6,4,144
4,2554,2,IT231-202,1,50,21,108,1728,1372,6,2,144

In [84]:
df.tail()

,Year,Term,Subject No.,Group,Limit,Registered,Course,Hours,People,Year Group,Term Group,All student
126,2565,2,IT2301-214,2,10,0,108,1728,1372,21,14,0
127,2565,2,IT2301-229,1,8,0,108,1728,1372,21,14,0
128,2565,2,IT2301-229,2,5,0,108,1728,1372,21,14,0
129,2565,2,IT2301-318,1,18,0,108,1728,1372,21,14,0
130,2565,2,IT2301-318,2,5,0,108,1728,1372,21,14,0

In [85]:
df.columns

Index(['Year', 'Term', 'Subject No.', 'Group', 'Limit', 'Registered', 'Course',
       'Hours', 'People', 'Year Group', 'Term Group', 'All student'],
      dtype='object')

In [86]:
df.describe()

,Year,Term,Group,Limit,Registered,Course,Hours,People,Year Group,Term Group,All student
count,131.000000,131.000000,131.000000,131.000000,131.000000,131.0,131.0,131.0,131.000000,131.000000,131.000000
mean,2560.358779,1.511450,1.893130,24.923664,10.473282,108.0,1728.0,1372.0,14.145038,7.854962,137.229008
std,3.760255,0.501788,2.016287,17.847481,11.089377,0.0,0.0,0.0,4.293326,2.654813,110.514849
min,2554.000000,1.000000,1.000000,1.000000,0.000000,108.0,1728.0,1372.0,5.000000,2.000000,0.000000
25%,2556.000000,1.000000,1.000000,10.000000,1.000000,108.0,1728.0,1372.0,12.500000,6.000000,63.000000
50%,2561.000000,2.000000,2.000000,20.000000,6.000000,108.0,1728.0,1372.0,15.000000,8.000000,105.000000
75%,2563.500000,2.000000,2.000000,50.000000,18.000000,108.0,1728.0,1372.0,16.000000,8.500000,144.000000
max,2565.000000,2.000000,21.000000,56.000000,51.000000,108.0,1728.0,1372.0,21.000000,14.000000,365.000000

Ok! Now our data is ready.

Let's do it!

- Widgets

In [87]:
#Creating the interactive dashboard
from ipywidgets import interact
@interact
def create_fare_plot(col = df.drop(['Registered', 'Limit'], axis =1).columns):
    sns.barplot(data = df, x = col, y ='Registered')
    plt.title(f'Mean Bar Plot of the People grouped by the {col}')

interactive(children=(Dropdown(description='col', options=('Year', 'Term', 'Subject No.', 'Group', 'Course', '…

- Dash by plotly

In [88]:
import dash
from dash import dcc, html
import plotly.express as px

In [89]:
app = dash.Dash()

fig = px.scatter(
    df,
    x="Registered",
    y="Year",
    size="All student",
    color="Group",
    hover_name = "Subject No.",
    log_x = True,
    )

app.layout = html.Div(children = [
html.H1(children='T.Kholed Dashboard'),
dcc.Graph(id="Registered_vs_Year", figure=fig)])

if __name__=="__main__":
    app.run_server(debug=True)

Dash is running on http://127.0.0.1:8050/

Dash is running on http://127.0.0.1:8050/

2023-02-17 17:19:49.123 Dash is running on http://127.0.0.1:8050/

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: on

SystemExit: 1

d:\Anaconduy\lib\site-packages\IPython\core\interactiveshell.py:3465: UserWarning:

To exit: use 'exit', 'quit', or Ctrl-D.

This code is possible. But i can't open the dashboard because of some problem.

- Streamlit

In [ ]:
import streamlit as st
import pandas as pd
import plotly.express as px
import seaborn as sns

In [ ]:
df = sns.load_dataset('titanic')
st.title('Titanic Dashboard')
st.subheader('Dataset')
st.dataframe(df)
st.subheader('Data Numerical Statistic')
st.dataframe(df.describe())

DeltaGenerator(_root_container=0, _provided_cursor=None, _parent=None, _block_type=None, _form_data=None)

This code is possible. But i can't open the dashboard because of some problem.

# To Be Continue...